{
  "title": "Conversation Quality Rubric",
  "description": "A rubric for scoring conversation quality based on key metrics.",
  "criteria": [
    {
      "id": "structure",
      "name": "Structure",
      "description": "Evaluates the organization and logical flow of the conversation.",
      "levels": {
        "5": "Excellent: The conversation has a flawless, logical structure. It includes a clear opening, a well-defined body, and a conclusive closing. The flow is natural and very easy to follow.",
        "4": "Good: The conversation is well-structured with a clear sense of direction. There might be minor deviations, but they don't detract from the overall logical progression.",
        "3": "Adequate: A basic structure is present, but some parts of the conversation may feel disorganized or difficult to follow. The transitions between topics may be abrupt.",
        "2": "Poor: The conversation lacks a clear structure. It often jumps between topics haphazardly, making it difficult to track the main points.",
        "1": "Very Poor: The conversation is completely disorganized and chaotic, with no discernible logical flow or structure."
      }
    },
    {
      "id": "empathy",
      "name": "Empathy",
      "description": "Evaluates the ability to understand, acknowledge, and validate the other person's feelings and perspective.",
      "levels": {
        "5": "Excellent: Consistently demonstrates deep understanding and validation of the other person's emotions and viewpoint. Responses are highly attuned and supportive.",
        "4": "Good: Generally shows empathy and acknowledges the other person's feelings. There may be occasional lapses or less impactful empathic statements.",
        "3": "Adequate: Acknowledges the other person's feelings, but often in a superficial or formulaic way. The emotional connection feels limited.",
        "2": "Poor: Rarely shows empathy. May be dismissive or fail to recognize the emotional state of the other person.",
        "1": "Very Poor: Complete lack of empathy. Actively invalidates or ignores the other person's feelings and perspective."
      }
    },
    {
      "id": "focus",
      "name": "Focus",
      "description": "Evaluates the ability to stay on topic and maintain relevance to the conversation's goals.",
      "levels": {
        "5": "Excellent: Stays completely on topic. All contributions are directly relevant to the main purpose of the conversation.",
        "4": "Good: Mostly focused on the topic, with only minor and brief digressions that do not disrupt the flow.",
        "3": "Adequate: The main topic is addressed, but there are several noticeable or lengthy digressions that distract from the core subject.",
        "2": "Poor: Frequently goes off-topic, making it difficult to follow the main thread of the conversation. The original purpose is often obscured.",
        "1": "Very Poor: Constantly off-topic. The original purpose of the conversation is completely lost or ignored."
      }
    },
    {
      "id": "clarity",
      "name": "Clarity",
      "description": "Evaluates the clarity, precision, and understandability of the language used.",
      "levels": {
        "5": "Excellent: Language is consistently precise, unambiguous, and easy to understand. Avoids jargon or explains it effectively.",
        "4": "Good: Generally clear and understandable communication. There may be minor instances of ambiguity or slightly confusing language.",
        "3": "Adequate: Communication is generally understandable but requires some effort from the listener due to vagueness, jargon, or convoluted sentence structures.",
        "2": "Poor: Communication is often unclear, ambiguous, or confusing, leading to misunderstandings.",
        "1": "Very Poor: Communication is largely incomprehensible, muddled, or nonsensical."
      }
    }
  ],
  "common_levels": {
    "0": "Complete failure to demonstrate the skill. The response is irrelevant, incomprehensible, or shows no attempt to engage with the metric."
  }
} 