{
  "title": "Conversation Quality Rubric",
  "description": "A rubric for scoring conversation quality based on key metrics.",
  "criteria": [
    {
      "id": "structure",
      "name": "Structure",
      "description": "Evaluates the organization and logical flow of the conversation.",
      "levels": {
        "5": "Very good: The overall structure is clear, with a recognizable opening, well-organized body, and conclusive closing. Information is presented in a logical order with smooth transitions. Minor lapses or imperfections are acceptable as long as the overall impression is very good.",
        "4": "Good: Obvious opening, body, and closing. Mostly logical and clear, with only minor lapses in order or transitions.",
        "3": "Adequate: Basic structure present, but some parts are out of order, missing, or abrupt. The flow is sometimes choppy or confusing.",
        "2": "Poor: Lacks clear structure. Information is scattered, topics jump frequently, and it is hard to identify the beginning, middle, or end.",
        "1": "Very Poor: No structure at all. Utterances are random, fragmented, or unrelated. No clear beginning, middle, or end. The listener cannot understand the main topic or purpose."
      }
    },
    {
      "id": "empathy",
      "name": "Empathy",
      "description": "Evaluates the ability to understand, acknowledge, and validate the other person's feelings and perspective.",
      "levels": {
        "5": "Very good: The user consistently identifies and addresses the other person's emotions and viewpoint, and expresses understanding, support, or comfort with specific language. Minor lapses or less detailed moments are acceptable as long as the overall impression is very good.",
        "4": "Good: Most responses show attention to the other person's feelings. Occasional lapses or less detailed empathy, but overall supportive.",
        "3": "Adequate: Sometimes acknowledges feelings, but often in a generic or formulaic way. Lacks depth or specific follow-up.",
        "2": "Poor: Rarely shows empathy. May be dismissive or ignore the other person's emotions.",
        "1": "Very Poor: Ignores or denies the other person's feelings, or is cold or impatient."
      }
    },
    {
      "id": "focus",
      "name": "Focus",
      "description": "Evaluates the ability to stay on topic and maintain relevance to the conversation's goals.",
      "levels": {
        "5": "Very good: The user stays on topic and nearly all statements are directly relevant to the conversation's main goal. Brief or minor digressions are acceptable as long as the overall focus is clear.",
        "4": "Good: Mostly focused, with only brief, minor digressions that do not disrupt the flow.",
        "3": "Adequate: Several noticeable or lengthy digressions, but the main topic is still addressed.",
        "2": "Poor: Frequently off-topic, making it hard to follow the main thread. The original purpose is often obscured.",
        "1": "Very Poor: Almost always off-topic. The original purpose is completely lost or ignored."
      }
    },
    {
      "id": "clarity",
      "name": "Clarity",
      "description": "Evaluates the clarity, precision, and understandability of the language used.",
      "levels": {
        "5": "Very good: Language is clear, concise, and unambiguous. Complex ideas are explained in an organized way. Minor unclear words or rare ambiguous expressions are acceptable as long as the overall clarity is very good.",
        "4": "Good: Mostly clear and understandable, with only minor ambiguity or imprecise wording.",
        "3": "Adequate: Generally understandable, but several vague, convoluted, or poorly chosen words. Listener must make an effort to understand.",
        "2": "Poor: Often unclear, ambiguous, or confusing, leading to misunderstandings.",
        "1": "Very Poor: Most of the content is incomprehensible, muddled, or nonsensical."
      }
    }
  ],
  "common_levels": {
    "0": "Complete failure to demonstrate the skill. The response is irrelevant, incomprehensible, or shows no attempt to engage with the metric."
  }
}
